Feature: Проверка на животно дали отговаря на изискванията да е родител

  Background:
    Given Потребителя отваря екрана за проверка на животни

  Scenario: Проверка на мъжко животно което отговаря на изискванията да бъде родител
    When Въведе "animal1" за номер на животно
    And Животното е "male"
    And Животното е на повече от две години
    And Натисне бутона за проверка
    Then Вижда съобщение: "Животното отговаря на изискванията да бъде родител"

  Scenario: Проверка на мъжко животно което не е на подходяща възраст да бъде родител
    When Въведе "animal2" за номер на животно
    And Животното е "male"
    And Животното е на по-малко от две години
    And Натисне бутона за проверка
    Then Вижда съобщение: "Животното не отговаря на изискванията да бъде родител"

  Scenario: Проверка на мъжко животно с невалиден номер
    When Въведе "animal5" за номер на животно
    And Животното е "male"
    And Животното е на повече от две години
    And Натисне бутона за проверка
    Then Вижда съобщение: "Грешни данни"

  Scenario: Проверка на женско животно което отговаря на изискванията да бъде родител
    When Въведе "animal3" за номер на животно
    And Животното е "female"
    And Животното е на повече от две години
    And Животното не е раждало през последните десет месеца
    And Натисне бутона за проверка
    Then Вижда съобщение: "Животното отговаря на изискванията да бъде родител"

  Scenario: Проверка на женско животно което не е на подходяща възраст да бъде родител
    When Въведе "animal4" за номер на животно
    And Животното е "female"
    And Животното е на по-малко от две години
    And Животното не е раждало през последните десет месеца
    And Натисне бутона за проверка
    Then Вижда съобщение: "Животното не отговаря на изискванията да бъде родител"

  Scenario: Проверка на женско животно което е раждало през последните десет месеца
    When Въведе "animal4" за номер на животно
    And Животното е "female"
    And Животното е на повече от две години
    And Животното е раждало през последните десет месеца
    And Натисне бутона за проверка
    Then Вижда съобщение: "Животното не отговаря на изискванията да бъде родител"

  Scenario: Проверка на женско животно с невалиден номер
    When Въведе "animal6" за номер на животно
    And Животното е "female"
    And Животното е на повече от две години
    And Животното не е раждало през последните десет месеца
    And Натисне бутона за проверка
    Then Вижда съобщение: "Грешни данни"